package com.alipay.config;

/* *
 *类名：AlipayConfig
 *功能：基�?��置类
 *详细：设置帐户有关信息及返回路径
 *版本�?.4
 *修改日期�?016-03-08
 *说明�?
 *以下代码只是为了方便商户测试而提供的样例代码，商户可以根据自己网站的�?��，按照技术文档编�?并非�?��要使用该代码�?
 *该代码仅供学习和研究支付宝接口使用，只是提供�?��参�?�?
 */

public class AlipayConfig {
	 
//↓↓↓↓↓↓↓↓↓↓请在这里配置您的基本信息↓↓↓↓↓↓↓↓↓↓↓↓↓↓�?

	// 合作身份者ID，签约账号，�?088�?���?6位纯数字组成的字符串，查看地�?��https://b.alipay.com/order/pidAndKey.htm
	public static String partner = "2088521449856262";
	
	// 收款支付宝账号，�?088�?���?6位纯数字组成的字符串，一般情况下收款账号就是签约账号
	public static String seller_id = "2088521449856262";

	// MD5密钥，安全检验码，由数字和字母组成的32位字符串，查看地�?��https://b.alipay.com/order/pidAndKey.htm
    public static String key = "4dkxpontv5ow54zxfg7qwk5c2yrdeyug";

	// 服务器异步�?知页面路�? �?ttp://格式的完整路径，不能�?id=123这类自定义参数，必须外网可以正常访问
	public static String notify_url = "http://www.mmcode.top:8080/create_direct_pay_by_user-JAVA-UTF-8/notify_url.jsp";

	// 页面跳转同步通知页面路径 �?ttp://格式的完整路径，不能�?id=123这类自定义参数，必须外网可以正常访问
	public static String return_url = "http://www.mmcode.top:8080/create_direct_pay_by_user-JAVA-UTF-8/return_url.jsp";

	// 签名方式
	public static String sign_type = "MD5";
	
	// 调试用，创建TXT日志文件夹路径，见AlipayCore.java类中的logResult(String sWord)打印方法�?
	public static String log_path = "C:\\";
		
	// 字符编码格式 目前支持 gbk �?utf-8
	public static String input_charset = "utf-8";
		
	// 支付类型 ，无�?���?
	public static String payment_type = "1";
		
	// 调用的接口名，无�?���?
	public static String service = "create_direct_pay_by_user";


//↑↑↑↑↑↑↑↑↑↑请在这里配置您的基本信息↑↑↑↑↑↑↑↑↑↑↑↑↑↑�?
	
//↓↓↓↓↓↓↓↓↓↓ 请在这里配置防钓鱼信息，如果没开通防钓鱼功能，为空即�?↓↓↓↓↓↓↓↓↓↓↓↓↓↓�?
	
	// 防钓鱼时间戳  若要使用请调用类文件submit中的query_timestamp函数
	public static String anti_phishing_key = "";
	
	// 客户端的IP地址 非局域网的外网IP地址，如�?21.0.0.1
	public static String exter_invoke_ip = "";
		
//↑↑↑↑↑↑↑↑↑↑请在这里配置防钓鱼信息，如果没开通防钓鱼功能，为空即�?↑↑↑↑↑↑↑↑↑↑↑↑↑↑�?
	
}

